In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

#### Applymap
* DataFrame'ler ile çalışır
* Alt elemanın ait elemanına etki eder

In [2]:
df = pd.read_csv("student.csv")

In [3]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [5]:
df_str = df[["name", "lastName"]]
df_str # String tipinde column'ları olan df

        name lastName
0    Alperen  Kolamuc
1  Cristiano  Ronaldo
2      Sinan    Engin
3      Fırat  Aydınus

In [6]:
df_str.apply(len)

name        4
lastName    4
dtype: int64

In [7]:
df_str.applymap(len)

   name  lastName
0     7         7
1     9         7
2     5         5
3     5         7